In [2]:
#importing all the tool kits needed to conduct this project
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

#import the dataset 
df = pd.read_csv('train.csv')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [18]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

##### After checking the data for null values as you can see we do have some but it shouldn't impede the analysis I want to conduct so theres no need to remove it

### Did the sex of the passenger have any impact on survival rate?

##### First lets get some basic demographics

In [30]:
survivors = pd.crosstab(index = df["Survived"], columns = "count")
survivors.index = ["Passed away", "Survived"]

In [31]:
survivors

col_0        count
Passed away    549
Survived       342

In [15]:
Sex = pd.crosstab(index = df["Sex"], columns = "count")

In [16]:
Sex

col_0   count
Sex
female    314
male      577

In [13]:
Class = pd.crosstab(index = df["Pclass"], columns = "count")

In [14]:
Class

col_0   count
Pclass
1         216
2         184
3         491

In [26]:
twowaytable_gender_survived = pd.crosstab(index = df["Survived"], columns = df["Sex"])
twowaytable_gender_survived.index = ["Passed away", "Survived"]
twowaytable_gender_survived

Sex          female  male
Passed away      81   468
Survived        233   109

##### From this two way table we can see that significantly more males died than females. This is interesting to see in the data because they say in history that the women and children were pushed onto the life rafts first.

In [36]:
df["Age"].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64